# pandas DataFrame

a dataframe holds two dimensional data
columns & rows

a pandas DataFrame adds loads of extra functionality

In [20]:
# import pandas
import pandas as pd

In [55]:
# create a DataFrame from a python map
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]
}

df = pd.DataFrame(people)

In [57]:
# print a truncated representation of a DataFrame
df
# in this small dataframe the truncation is not apparent

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [68]:
# set options to display more/less columns and rows in dataframes
pd.set_option('display.max_columns', 2)
pd.set_option('display.max_rows', 2)

In [56]:
# shape returns the count of rows and columns in the DataFrame
df.shape

(3, 3)

In [69]:
# print a truncated representation of a DataFrame
df
# with our new option settings the truncation is apparent

    first  ...                    email
0   Corey  ...  CoreyMSchafer@gmail.com
..    ...  ...                      ...
2    John  ...        JohnDoe@email.com

[3 rows x 3 columns]

In [67]:
# info prints information about the columns in the datafrrame
df.info()
# Dtype of object are strings

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   3 non-null      object
 1   last    3 non-null      object
 2   email   3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [58]:
# fetch a single column of a DataFrame using dot notation
df.email
# dot notation can be problematic when column names match python reserved words

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [59]:
# fetch a single column of a DataFrame using 
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [60]:
# the column is of type Series
type(df['email'])

pandas.core.series.Series

In [61]:
# filter dataframe
df[['first', 'last']] # returns type DataFrame

   first     last
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [62]:
# get all columns of a DataFrame
df.columns # returns type Index

Index(['first', 'last', 'email'], dtype='object')

In [63]:
# use integer location to fetch a single row from a DataFrame
df.iloc[0] # returns type Series

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [64]:
# use integer location to fetch a multiple rows from a DataFrame
df.iloc[[0,1]] # returns type DataFrame

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [65]:
# use label location to fetch a single row from a DataFrame
df.loc[0] 
# this looks just like iloc but is referencing the row label
# later when we cover indexing

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [66]:
# using iloc and loc we can fetch subsets of columns and rows from a Dataframe
df.loc[[1,2], ['last','first']]

  last first
1  Doe  Jane
2  Doe  John